# GetDocumentVersion Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
BasicFileInfo..::..GetDocumentVersion Method
BasicFileInfo Class See Also
---
Gets the DocumentVersion for the file.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public DocumentVersion GetDocumentVersion()
```

Visual Basic
---
```text
Public Function GetDocumentVersion As DocumentVersion
```

Visual C++
---
```text
public:
DocumentVersion^ GetDocumentVersion()
```

# ### Return Value
The DocumentVersion for the file.
# See Also
BasicFileInfo Class
Autodesk.Revit.DB Namespace